## 피벗(Pivot) 실습

- 대량의 데이터(DataFrame)에서 원하는 컬럼을 선택해서 Index, Column, Value로 설정

- 새로운 DF 객체 생성

- 함수 및 메서드 
    - => pandas.pivot(), pandas.DataFrame.pivot()
    - => pandas.pivot_table(), pandas.DataFrame.pivot_table()

In [3]:
# 모듈 로딩
import pandas as pd

# 데이터 생성
df = pd.DataFrame({'foo': ['one', 'one', 'one', 'two', 'two',
                           'two'],
                   'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'baz': [1, 2, 3, 4, 5, 6],
                   'zoo': ['x', 'y', 'z', 'q', 'w', 't']})

In [4]:
df

   foo bar  baz zoo
0  one   A    1   x
1  one   B    2   y
2  one   C    3   z
3  two   A    4   q
4  two   B    5   w
5  two   C    6   t

In [6]:
# 데이터 구성 확인
# 데이터 전처리 => 정제 (Cleaning)
df.isnull().sum()

foo    0
bar    0
baz    0
zoo    0
dtype: int64

In [8]:
# 중복 체크
df.duplicated().sum()

0

In [9]:
# pivot()으로 원하는 DF 생성
myDF=pd.pivot(df, index='foo', columns='bar', values='baz')

In [10]:
myDF

bar  A  B  C
foo
one  1  2  3
two  4  5  6

In [11]:
df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
                         "bar", "bar", "bar", "bar"],
                   "B": ["one", "one", "one", "two", "two",
                         "one", "one", "two", "two"],
                   "C": ["small", "large", "large", "small",
                         "small", "large", "small", "small",
                         "large"],
                   "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                   "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})

In [12]:
df

     A    B      C  D  E
0  foo  one  small  1  2
1  foo  one  large  2  4
2  foo  one  large  2  5
3  foo  two  small  3  5
4  foo  two  small  3  6
5  bar  one  large  4  6
6  bar  one  small  5  8
7  bar  two  small  6  9
8  bar  two  large  7  9